library = {
    '주식': '주주의 소유권 및 재산권을 나타내는 증서.',
    '채권': '자금을 빌려주고 받는 증서.',
    '펀드': '개인이 직접투자를 하는 주식과 다르게 자산운용사의 펀드매니저가 대신 투자를 하는 간접투자 방식이다.',
    '코스피': '코스피(KOSPI), 국내 상장사 중 규모가 크고 안정적인 종목들이 모여 있는 시장.',
    '코스닥': '코스닥((KOSDAQ), 자금조달이 어려운 중소기업과 벤처기업을 대상으로 하는 시장.',
    '보통주': '일반적으로 우리가 얘기하는 주식을 보통주, 의결권을 포기하는 대신 더 많은 배당을 받을 수 있는 주식은 우선주.',
    '우선주': '일반적으로 우리가 얘기하는 주식을 보통주, 의결권을 포기하는 대신 더 많은 배당을 받을 수 있는 주식은 우선주.',
    '시가총액': '개별 종목들의 경우에는 ‘발행주식총수 x 주가’가 시가총액이 되고 코스피와 같이 시장의 시가총액을 말할 때는 ‘해당 시장 내 상장사들의 시가총액의 합’을 의미한다.',
    '1월 효과': '매년 1월마다 주가가 상승한다는 효과. 중소형주가 대형주에 비해 수익률이 높아지는 것.',
    '코스피200': '한국의 대표지수이며 외국인 및 기관투자자들이 중심적으로 거래하는 지수이기도 하다.',
    '코스닥150': '시가총액, 유동성, 업종분포 등을 고려해 150개 종목을 뽑아 만든 지수.',
    '가치주': '벌어들이는 돈이나 향후 비전에 비해 현재 주가가 싸다고 판단되는 주식. = 저평가 우량주',
    '성장주': '지금 성장률이 높고 앞으로도 성장가능성이 높은 기업 or 지금은 성장률이 미미하지만 앞으로 큰 성장과 수익이 기대되는 기업',
    '매매수수료': '주식 거래 시 증권사에 내는 수수료.',
    '유관기관 수수료': '주식 거래 시 거치는 기관에 내는 수수료.',
    '증권거래세': '주식 매도 시 발생하는 세금이다.',
    '배당소득세': '배당주를 통해 받는 배당금에 대해 떼는 세금.',
    '양도소득세': '주식을 팔 때 그동안 주가가 상승한 차익에 대해 떼는 세금.',
    'T+2 시스템': '주식 매수 및 매도 시 2거래일 뒤에 입출금되는 시스템.',
    '미수거래': '일정한 증거금으로 주식을 매수한 후 이틀 뒤 갚는 거래.',
    '예수금':'증권사에 들어있는 현금.',
    '신용거래':'증권사에서 돈을 빌려 투자하는 것.',
    '호가':'사거나 팔려는 주식의 가격을 부르는  행위.',
    '공모주': '비상장회사가 처음 상장하며 투자자들을 공개모집할 때 발행하는 주식.',
    'IPO':'기업공개',
    '베이시스': '베이시스(Basis), 현물과 선물의 가격 차이.',
    '배당금': '기업의 이익잉여금을 주주에게 분배하는 것.',
    '배당기준일': '매년 주식시장의 마지막 거래일.',
    '배당락일': '주식을 사도 배당을 받을 수 없는 날.',
    '자사주 매입': '어떤 기업이 자사 주식을 사들이는 것.',
    '자사주 소각': '매입한 주식을 서류상 없는 주식으로 만들어 버리는 것.',
    '이동평균선' : '일정 기간 동안의 주가를 평균 내고 이를 줄로 그은 것.',
    '이격도' : '현 주가가 평균선에 비해 얼마나 떨어져 있는지 나타내는 것.',
    '리츠' : '리츠(Reits), 부동산투자신탁. 다수의 투자자들로부터 모은 자금으로 부동산을 사거나 관련 증권에 투자해서 발생한 임대수익을 투자자에게 배당하는 주식회사.',
    '옵션' : '미리 정해진 가격에 정해진 기간 냐에 매수 및 매도를 할 수 있는 권리.',
    '골든크로스': '단기 이동평균선이 중기, 장기 이동평균선을 위로 뚫고 올라서는 현상.',
    '데드크로스': '골든크로스의 반대 상황.',
    '데드캣 바운스': '죽은 고양이도 한 번은 뛰어오른다는 뜻으로 주가가 큰 폭의 하락 후 잠깐 반등하는 현상을 뜻한다.',
    '추세선': '일정 범위 내에서 움직이려는 성질을 가진 주가의 흐름을 이어 줄로 그은 것.',
    '거래량': '그날 주식이 거래된 양.',
    '괴리율': '투자수요나 시장환경 때문에 가격이 벌어지는 것.',
    'ETF': 'ETF(상장지수펀드), 최소 10종목 이상 묶어 만든 지수를 추종하게 만든 펀드. 거래소를 통해 평범한 주식처럼 매매할 수 있다.',
    'ETN': 'ETN(상장지수증권), 증권사가 투자자에게 만기 때 특정 자산이나 특정 지수(이하 특정 자산)의 가격 변동에 따라 투자금을 돌려주겠다고 약속한 상품.',
    'ELS': 'ELS(주가연계증권), 증권사가 투자자에게 특정 주가지수 or 종목 가격이 일정 수준으로만 하락, 상승하지 않으면 사전에 정해진 이자를 주기로 약속한 상품.',
    '롤오버': '만기가 도래한 선물을 팔고 그 다음 만기가 도래하는 선물을 사는 것.',
    '이주석': 'Stocker 개발자 중 한 명이다.'
}

def stockWord(word):
    if word in library:
        return library[word]
    else:
        return '그런 단어는 없습니다. 개발자에게 추가를 요청해주세요.'
    
def wordList():
    result =[f'총 {len(library)}개의 단어가 등재되어 있습니다.\n']
    for word in sorted(library):
        result.append(word)

    return '\n'.join(result)